---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ElementTypeDuplicatedEventArgs Properties
ElementTypeDuplicatedEventArgs Class See Also Send Feedback
---

The ElementTypeDuplicatedEventArgs type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitAPIEventArgs.) |
|  | Document | The document associated with the event.  (Inherited from RevitAPIPostDocEventArgs.) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RevitAPIEventArgs.) |
|  | NewElementTypeId | The id of the newly duplicated ElementType. |
|  | NewName | The name of the newly duplicated ElementType. |
|  | OriginalElementTypeId | The id of the element type that is duplicated. |
|  | Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler).  (Inherited from RevitAPIPostEventArgs.) |

# See Also

ElementTypeDuplicatedEventArgs Class

Autodesk.Revit.DB.Events Namespace